{
  "assignment": "The name of the assignment.\n\nExample: \"Problem Set 7\"\n",
  "class": "The name of the class.\n\nExample: \"Math 171, Fall 2017\"\n",
  "clearpage": "Whether to start a new page after each problem solution.\n",
  "clearpage-option": "Whether to make the 'clearpage' option customizable directly within\nthe document.\n",
  "document-macros": "Additional document- or domain-specific macros to define.\n",
  "duedate": "When the assignment is due.\n\nExample: \"Thursday, October 12\"\n",
  "fancy-lists": "Whether to load the 'enumitem' package. This is required in order to\ncustomize list numbering.\n",
  "fancy-marginals": "Whether to load the 'fancyhdr' package. This is required in order to add\ncontent to the header and footer.\n",
  "fancy-math": "Whether to load the 'amsmath' and 'amssymb' packages.\n",
  "fancy-page-layout": "Whether to load the 'geometry' package. This is required in order to set the\nmargins.\n",
  "firstpage-header": "Which information to display in the header on the first page, if a header is\ndisplayed (see 'use-firstpage-header').\n",
  "firstpage-marginals": "Which information to display in the header and footer on the first page, if\nthis is supposed to be different than the header and footer on other pages\n(see 'use-firstpage-marginals' and 'primary-marginals').\n",
  "font-size": "The primary font size of the document.\n",
  "if-order": "The order in which to put the declarations of any options that are declared.\n",
  "indent-paragraphs": "Whether to indent the first line of a paragraph, instead of inserting a blank\nline between adjacent paragraphs. Setting this to false causes the 'parskip'\npackage to be loaded.\n",
  "list-number-style": "The style of list numbering for each level of list, or for all simultaneously\nif only a single string is given.\n",
  "macro-order": "The order in which to put automatically generated document structure macros.\n",
  "margin": "The margin size of the document.\n",
  "marginal-position-order": "The order in which to place settings related to the content of headers and\nfooters.\n",
  "name": "Your name.\n",
  "primary-marginals": "Which information to display in the header and footer of most pages.\n",
  "problem-macro": "Whether to generate a \\problem macro instead of inserting the code inline for\neach problem individually.\n",
  "problems": "The names of the problems for which placeholders are to be inserted into the\ndocument.\n",
  "show-page-count": "Whether to display the total number of pages (\"3 of 5\") instead of just the\ncurrent page number (\"3\").\n",
  "solution-macro": "Whether to generate a \\solution macro instead of inserting the code inline\nfor each solution individually.\n",
  "use-firstpage-header": "In addition to any configured marginals, also display a header on the first\npage (see 'firstpage-header').\n",
  "use-firstpage-marginals": "Use different header and footer content on the first page than on other\npages (see 'firstpage-marginals' and 'primary-marginals').\n",
  "variable-order": "The order in which to place declarations of any variables that are declared.\n"
}
